#1
print(5<3 and 10<2)           
print(7==8 and 2==5)        
print(4<2 and 60<24)                
print(3<1 and 9==2)
print(425525<0 and 2535==25)
print(5<3 or 10>2)           
print(8==8 or 2>5)            
print(4>2 or 10>4)               
print(3<4 or 9==9)
print(10==10 or 2==2)


#2
#sequencing ნიშნავს, რომ კოდი სრულდება ზედიზედ, რიგრიგობით, ერთი მოქმედება მეორის შემდეგ.
#პროგრამა მიჰყვება ნაბიჯებს ზუსტად იმ თანმიმდევრობით, როგორც ისინი დაწერილია კოდში.

#iteration არის პროცესის განმეორება. ციკლები (როგორიცაა for ან while) გვეხმარება ერთი და იმავე კოდის 
#ბევრჯერ შესრულებაში, სანამ რაღაც პირობა შესრულდება ან მითითებული რაოდენობის გამეორებები არ დასრულდება.

#Selection ნიშნავს, რომ პროგრამა ირჩევს სხვადასხვა მიმართულებას შესასრულებლად პირობიდან გამომდინარე.
#ანუ, თუ პირობა მართალია — ერთი გზა აირჩევა, თუ არა — სხვა.

#3
name = "giorgi"      #ვქმნით ცვლადს სახელით name და ვანიჭებთ მას მნიშვნელობას "გიორგი"  
age = 11             #ვქმნით ცვლადს age და ვანიჭებთ მას მნიშვნელობას 11   
print("გამარჯობა")   #ვბეჭდავთ ტექსტს
print(name)          #ვბეჭდავთ ცვლადის მნიშვნელობას (სახელს)
print(age)           #ვბეჭდავთ ასაკს

#4
#For loop არის ციკლი, რომელიც გვეხმარება კოდის განმეორებით შესრულებაში კონკრეტული რაოდენობისჯერ.
#For loop გამოიყენება მაშინ, როცა წინასწარ ვიცით რამდენჯერ უნდა შესრულდეს მოქმედება.
#ის გვინარჩუნებს დროს, გვიმარტივებს კოდს და თავიდან გვარიდებს ერთი და იმავე კოდის გადაწერას მრავალჯერ.

#5
# range() ქმნის რიცხვების მიმდევრობა, რომელსაც for loop-ს იყენებს.
# მას შეიძლება გადაეცეს 1, 2 ან 3.
# for loop მიდის თითოეულ ელემენტზე range-ის მიერ შექმნილ რიცხვებში და ასრულებს კოდს მის შიგნით.

#6
for s in range(30):
    print("Nissan Skyline GT-R R34")

#7
for k in range(100):
    print("kandelaki")    

#8
for b in range(46):
    print("blue")    

#9
for i in range(32):
    print("g")

#10
str1=input("enter your name")
str2=input("enter your name")
str3=input("enter your name")
num1=int(input("enter your age"))
num1=str(num1)
print(str1+str2+str3+num1)

#11
a="giorgi"
b=30
c=30.4
d=True
print(type(a))
print(type(b))
print(type(c))
print(type(d))

#12
num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))
num3 = int(input("შეიყვანე მესამე რიცხვი: "))
num4 = int(input("შეიყვანე მეოთხე რიცხვი: "))
print(num1+num2+num3+num4)
