#1)კომენტარის სახით ჩამოწერეთ რომელი მონაცემთა ტიპები ვისწავლეთ და თთეულს გვერდით მიუწერეთ 1 მაგალითი
name="string"
num=1
mteli=1.1
nice=True
sia=[]

#2)ტერმინალში გამოიტანეთ 1 სტრინგი 1 ინტეჯერი 1 ფლოუთი 1 ბულეანი
name="string"
num=1
mteli=1.1
nice=True
print(name)
print(num)
print(mteli)
print(nice)

#3)შექმენი 4 ცვლადი snake_case ის გამოყენებით,1 ში შეინახე სტრინგი მეორეში ინტეჯერი მესამეში ბულეანი მეოთხეში ფლოუთი,დაპრინტე თითოეული ამთგანი(გამოიყენე ცვლადის სახელები)
name_string="str"
age_integer=1
True_boolean=False
float_nums=30.7

#4)შექმენი 2 ცვლადი სადაც შეინახავ ინტეჯერ ტიპის მონაცემებს,თქვენი დავალებაა რომ ამ ორ რიცხვზე მოახდინოთ ყველა მათემატიკური მოქმედება რაც ვისწავლეთ
x=1
y=2
print(x+y)
print(x-y)
print(x*y)
print(x/y)

#5)შექმენი ორი ცვლადი შეინახე ორივეში სტრინგებიდ და შეკრიბე ეს ორი სტრინგი,ასევე კომენტარის სახით დაწერე რა ეწოდება ამ მოქმედებას(სტრინგების შეერთებას)
str1="manqana"
str2="avtobusi"
print(str1+str2)

#6)კომენტარის სახით ახსენით თითოეული რას აკეთებს და მოიყვანე თითო მაგალით --> % , // , **
# ** ეს არის ხარისხები 

#7)მომხმარებელს შემოატანინე ორი რიცხვი და მოახდინე აბსოლიტურად ყველა ამთემატიკური მოქმედება ამ ორ რიცხვზე --> + - * / // ** %
x=int(input("enter first number"))
y=int(input("enter second number"))
print(x%y)
print(x//y)
print(x**y)

#Bouns
# ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

#      15 / 3 = 5
#      20 / 4 = 5
#      

#      15 // 10 = 1 
#      10 // 7 = 1
#      

#      4 * 3 = 12
#      40 * 3 = 120
#      120 * 3 = 360

#      4 ** 3 = 64
#      10 ** 3 = 1000
#     

#      10 % 7 = 3
#      3 % 2 = 1


#8)კომენტარის სახით ახსენით თთოეული რას აკეთებს --> str() , int() , float(),მოიყვანე თითო მაგალითი სამივე მათგანზე
name="20"
print(float(name))
#9)შექმენი 4 ცვლადი სადაც შეინახავ განსხვავებული ტიპის მონაცემებს,შენი დავალებაა რომ დაბეჭდო მათი ტიპები,გამოიყენე ნასწავლი ფუნქცია რომელიც იგებდა ფრჩხილებში გადაცემული ელემენტის ტიპს
j="string"
k=20
a=2.2
b=True
print(type(j))
print(type(k))
print(type(a))
print(type(b))

#10)მომხმარებელს შემოატანინე ორი რიცხვი,შენი დავალეაბაა ამ ორ რიცხვზე მოახდინოთ შედარების ოპერაციები(გამოიყენე ყველა შედარების ოპერატორი რაც ვისწავლეთ),
x=int(input("first"))
y=int(input("second"))
print(x>y)
print(x<y)
print(x==y)
print(x>=y)
print(x<=y)

#11)კომენტარის სახით ახსენით რომელი ლოგიკური ოპერატორები ვისწავლეთ და რომლის გამოყენების დროს რა ხდება,მოიყვანე თითო მაგალითი 

#12)გვერდით მიუწერეთ პასუხები წერტილების მაგივრად
#                                
# True and True -- true      |   True or True -- true         
# True and False -- false    |   True or False -- true
# False and True -- false   |   False or True -- true
# False and False -- false   |   False or False -- false 

#13)გვერდით მიუწერეთ საბოლოო პასუხი წერტილების მაგივრად
#  5 == 10 and 10 <= 10 false   |   True or "giorgi" == "giorgi" -- true           
# True and False -- false       |   10 < 2 or "lasha" == "beqa" -- false 
# 10 > 3 and 5 == 3 -- false     |   2 >= 3 or 40 < 2 -- false
# True and 200 <= 200 -- true    |   4 == 3 or 50 > 300 -- false 


#14)ტერმინალში გამოიტანეთ თქვენი რიცხვები 5 იდან 200 მდე for loop
for i in range(5,200,1):
    print(i)
#15)ტერმინალში გამოიტანეთ რიცვები 100 დან 150 მდე 5 ის სტეპის გამოტოვებით for loop
for x in range(100,150,5):
    print(x)

#16)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ for loop
for g in range(1,10,1):
    print("giorgi")
#17)ტერმინალში გამოიტანეთ რიცხვები 10 იდან 50 მდე while loop
x=10
while x<50:
    print(x)
    x=x+1

#18)ტერმინალში გამოიტანეთ რიცვები 50 დან 150 მდე 10 ის სტეპის გამოტოვებით while loop
y=50
while y<150:
    print(y)
    y=y+10
#19)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ while loop
g=1
while g<10:
    print("giorgi")
    g=g+1

#20) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი და for loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი 
name=["merabiko","gio","goga","ilia","zma"]
for k in range(0,5):
    print(name[k])

#21) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი დაwhile loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი 
name=["merabiko","gio","goga","ilia","zma"]
z=0
while z<5:
    print(name[z])
    z=z+1
#22)შექმენი სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"],შენი დავალებაა ამ სიიდან გამოიტანო  საბა და იამზე როგორც დადებით ასევე უარყოფითი ინდექსების გამოყენებით
saxeli=["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]
print(saxeli[2])
print(saxeli[-4])
print(saxeli[5])
print(saxeli[-1])
#23)შექმენი ცვლადი სადაც შეინახავ სტრინგს --> "ჰიდროელექტროსადგური" , შენი დავალებაა რომ გამოიტანო მესამე და მერვე ინდექსზე მდგომი ასოები ტერმინალში
hard_word="ჰიდროელექტროსადგური"
print(hard_word[3])
print(hard_word[8])
#24)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებ რიცხვს , შემდეგ --> თუ მომხმარებლის მიერ შემოტანილი რიცცხვი არის 0 ზე მეტი დაუპრინტე -->"more than 0" , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები დაუპრინტე --> "Less than 0",სხვა შემთხვევაშიდ აუპრინტე --> "Equal 0"
momxmarebeli=int(input("enter number"))
if momxmarebeli > 0:
    print("more than 0")
elif momxmarebeli < 0:
    print("Less than 0")   
else:
    print("Equal 0")    
#25)შექმენი ცვლადი სადაც შეინახავ ადამიანების სახელებi(6 ცალი) სიას-->შემდეგ შეამოწმეთ --> თუ ამ სიაში მესამე ინდექსზე მდგომი ელემენტი არის "lasha" -->დაუპრინტე --> "You choose lasha" , თუ სიაში მყოფი ბოლო ინდექსზე მდგომი ელემენტი არის "giorgi" მაშინ დაუპრინტე -->"you choose giorgi" , სხვა შემთხვევაში დაუპრინტე --> "you choose other name"
lot_name=["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]
if lot_name [3] == "lasha":
    print("you choose lasha")
elif lot_name [-1] == "giorgi":
    print("you choose giorgi")
else:
    print("you choose other name")    

# 26)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#             break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი

code="gogagoa"
code2=(input("enter password"))
while True:
    if code2 == code:
        print("გამოიცანი")
        break
    else: 
        code2=(input("enter password"))
        

    


#27)შექმენი ცვლადი და შეინახე სტრინგი --> "ჰიდროელექტროსადგური" , შენი დავალებაა რომ ტერმინალში გამოიტანო სადგური ,გამოიყენე slicing, ასევე კიდევ გამოიტანე ელექტროსადგური აქაც გამოიყენე სლაისინგი
word = "ჰიდროელექტროსადგური"
print(word[12:18])
print(word[5:18])


#28)შექმენი ცვლადი და შეინახე სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"] , შენი დავალებაა რომ ტერმინალში გამოიტანო ყველა სახელი საბადან სანიმდე,ასევე გამოიტანე სახელები გოგადან ირმა მდე გამოიყენე Slicing
სახელი=["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანიმდე" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"]
print(სახელი[2:6])

#29)შექმენი სია სადაც შეინახავთ ინტეჯერებს,შენი დავალებაა შეამოწმო,თუ სიაში მყოფი მენულე ინდეწსზე მდგომი ელემენტი მეტია სიაში მყოფ ბოლო ინდექსზე მდგომ ელემენტზე და(and) ასევე სიის პირველი ელემენტი მეტია 0 ზე დაუპრინტე --> good , თუ სიის პირველი ელემენტი მეტია სიის ბოლო ელემენტზე და(and) სიის ნოლო ელემენტი ნაკლებია 0 ზე დაუპრინტე --> bad , სხვა შემთხვევაში დაუპრინტე -->"get out"
int1=[1,2,3,4,5]
if int1 [0] > int1 [4] and int1 [0] > 0:
    print("good")
elif int1 [0] > int1 [4] and int1 [4] < 0:
    print("bad")
else:
    print("get out")         
    

#30)მომხმარებელს შემოატანინე ათწილადი,შემდეგ შეადარე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე მეტი და 30 ზე ნაკლები მაინ დაუპრინტე -->You entered number between 10 and 30, თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე ნაკლები და 0 ზე მეტი მაშნ დაუპრინტე --> You choose number between 0 and 10 , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები მაშინ დაუპრინტე you choose negative number , სხვა შემთხვევაში დაუპრინტე -->you choose zero(0)
h=float(input("enter float"))
if h > 10 and h<30:
    print("You entered number between 10 and 30")
elif h < 10 and h > 0:
    print("You choose number between 0 and 10")
elif h < 0:
    print("you choose negative number")
else:
    print("you choose zero(0)")


#31)შექმენი სია სადაც შეინახავ სტრინგებს(ადამიანის სახელებს,რაც გინდათ და რამდენიც გინდათ),შემდეგ შეადარეთ თუ ამ სიაში მყოფი მე0 ინდექსზე მდგომი ელემენტი არის 'luka' ან(or) არის "saba" დაუპრინტე -->You choose luka or saba, თუ ამ სიაში მყოფი ბოლო ინდექსზე მყოფი ელემენტი არის "irma" ან(or) "iamze" მაშინ დაუპრინტე --> You choose irma or iamze,სხვა შემთხვევაში დაუპტინტე --> You choose other name

f = ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანიმდე" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"]
if f [0] == "luka" or f [0] == "saba":
    print("You choose luka or saba")
if f [0] == "irma" or f [0] == "iamze": 
    print("You choose irma or iamze")
else:
    print("You choose other name")