#1
my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

print("პირველი 5 ელემენტი:", my_list[:5])
print("ბოლო 3 ელემენტი:", my_list[-3:])
print("ელემენტები 3-დან 7 ინდექსამდე:", my_list[3:8])


#2
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

print("პირველი 6 ელემენტი:", my_list[-15:-9])
print("ბოლო 10 ელემენტი:", my_list[-10:])
print("ელემენტები 7-დან 14 ინდექსამდე:", my_list[-8:])


#3
word = 'თვითმფრინავი'
print(word[-4:])


#4
word = 'Programmer'
print(word[:3]) 


#5
days = ['ორშაბათი', 'სამშაბათი', 'ოთხშაბათი', 'ხუთშაბათი', 'პარასკევი', 'შაბათი', 'კვირა']

print("სამუშაო დღეები (დადებითი ინდექსებით):", days[0:5])
print("სამუშაო დღეები (უარყოფითი ინდექსებით):", days[-7:-2])
print("დასვენების დღეები (დადებითი ინდექსებით):", days[5:7])
print("დასვენების დღეები (უარყოფითი ინდექსებით):", days[-2:])


#6
sentence = 'Python slicing is very powerful'


print(sentence[0:6])     
print(sentence[7:14])    
print(sentence[22:31])   
print(sentence[-31:-25])
print(sentence[-24:-17]) 
print(sentence[-9:])     