#1
# ეს ოპერატორი აყრის რიცხვს მოცემულ ხარისხში მაგ: 2**3=8
# ბოლოს მოვახდენთ მთელობით გაყოფას: 3 // 2 = 1. ეს ოპერატორი გვიბრუნებს მხოლოდ მთელ ნაწილს.,
# შემდეგ მოვხდენთ ნაშთს: 8 % 5 = 3. ეს ოპერატორი გვიბრუნებს გაყოფის ნაშთს.

<<<<<<< HEAD

=======
>>>>>>> b31503daa9ae36f7b689361a44475e5e28baf64b
#2
# ცვლადი მხოლოდ ერთი მნიშვნელობით მუშაობს, ხოლო სია - მრავალით.
# სია (list) გამოიყენება, როცა გვჭირდება რამდენიმე მონაცემის შენახვა ერთდროულად.
# მაგალითად, თუ გვინდა შევინახოთ რამდენიმე რიცხვი, ტექსტი ან სხვადასხვა ტიპის მონაცემები.

#3
my_data = [10, 3.14, 'Python', True, [1, 2, 3]]
print(my_data)