# string  --> არის ტექსტი რომელიც იწერება ბრჭყალებში მაგ: "გიორგი"   "87"                                

"integer --> შემოკლებულად int არის მთელი რიცხვები მაგ: 30, 60, 1644"

"float --> არის ათწილადი რიცხვები მაგ: 10.6, 3.3"

"boolean --> მისი მნიშვნელობა (შედეგი) არის true ან false ანუ ჭეშმარიტი ან მცდარი"
 



ჩიფსი="doritos"
print(ჩიფსი)    # იგივეა რა print("doritos")

x=7
print(x)   # იგივეა რაც print (7)

y=9.9  
print(y)   # იგივეა რაც print (9.9)

z=5
f=6
z<f    # შედეგი იქნება True
z>f    # შედეგი იქნება false



# ცვლადი ეს არის ჩვენს მიერ მოგონილი ნივთი რომელსაც ვანიჭებთ მნიშვნელობას. ეს მნიშვნელობა შეიძლება იყოს string, int, float.



სახელი="გიორგი"

ასაკი=11

სიმაღლე=1.52